import React from 'react'
import img from "./Picture.png"
import "./styles.scss"

const OneCartProduct = () => {
      return (
            <div className='onecartprod'>
                  <img src={img} />
                  <div className='desc'>
                        <p className='title'>M&M’s шоколадные конфеты
                              130гр </p>
                        <p className='count'>Осталось: 2 шт.</p>
                  </div>
                  <div className='counter'>
                        <button><svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                              <path d="M3.99652 13H20C20.5523 13 21 12.5523 21 12C21 11.4477 20.5523 11 20 11H3.99652C3.44424 11 2.99652 11.4477 2.99652 12C2.99652 12.5523 3.44424 13 3.99652 13Z" fill="#46C578" />
                        </svg>
                        </button>
                        <p>0</p>
                        <button>
                              <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M11.8834 3.00673L12 3C12.5128 3 12.9355 3.38604 12.9933 3.88338L13 4V11H20C20.5128 11 20.9355 11.386 20.9933 11.8834L21 12C21 12.5128 20.614 12.9355 20.1166 12.9933L20 13H13V20C13 20.5128 12.614 20.9355 12.1166 20.9933L12 21C11.4872 21 11.0645 20.614 11.0067 20.1166L11 20V13H4C3.48716 13 3.06449 12.614 3.00673 12.1166L3 12C3 11.4872 3.38604 11.0645 3.88338 11.0067L4 11H11V4C11 3.48716 11.386 3.06449 11.8834 3.00673L12 3L11.8834 3.00673Z" fill="#46C578" /></svg>
                        </button>
                  </div>
                  <div className='price'>
                        <p className='major'>820 тг.</p>
                        <p className='creat'>410 тг./шт.</p>
                  </div>
                  <svg className='cancel' width="34" height="34" viewBox="0 0 34 34" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M23.2473 10.5289L23.3345 10.6066C23.6972 10.9693 23.7231 11.5411 23.4122 11.9336L23.3345 12.0209L18.3848 16.9706L23.3345 21.9203C23.6972 22.283 23.7231 22.8548 23.4122 23.2473L23.3345 23.3346C22.9719 23.6972 22.4001 23.7231 22.0075 23.4123L21.9203 23.3346L16.9706 18.3848L12.0208 23.3346C11.6582 23.6972 11.0864 23.7231 10.6938 23.4123L10.6066 23.3346C10.244 22.9719 10.2181 22.4001 10.5289 22.0076L10.6066 21.9203L15.5564 16.9706L10.6066 12.0209C10.244 11.6582 10.2181 11.0864 10.5289 10.6939L10.6066 10.6066C10.9692 10.244 11.5411 10.2181 11.9336 10.5289L12.0208 10.6066L16.9706 15.5564L21.9203 10.6066C22.283 10.244 22.8548 10.2181 23.2473 10.5289L23.3345 10.6066L23.2473 10.5289Z" fill="#ABABAB" />
                  </svg>
            </div>
      )
}

export default OneCartProduct
